#include <stdio.h>
int main()
{
int N = 3, K = 40; 
float n = 2, L = 331;  
printf("%2d\n\t%3d\n\t\t%4d\n", 1, 2, 3, 4);
printf("%10.5f\n", 12.234657); 
printf("%d:%d = %d, остаток = %d\n",7, 5, 7/5, 7%5); 
printf("%dx%d = %d\n",2000, 4, 2000*4);
printf("%g разделить %e равно %f\n",5., 2., 5./2); 
printf("%d разделить %d равно %d\n",5., 2., 5./2); //десятичные числа со знаком
printf("%f разделить %f равно %f\n",5., 2., 5./2); //получаются десятичные числа с запятой
printf("%g разделить %g равно %g\n",5., 2., 5./2); //выбор по принципу что короче между %f и %e
printf("%e разделить %e равно %e\n",5., 2., 5./2); //получаются числа числа в виде х.хх е+хх

printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
printf("Идет %d минута суток\n", N*60 + K);
printf("До полуночи осталось %d часов и %d минут\n", (1440-(N*60 + K))/60, (1440-(N*60 + K))%60);
printf("С 8.00 прошло %d секунд\n", (N*3600 + K*60) - 28800);
printf("Текущий час = %d/24 суток  и текущая минута = %d/60 часа\n", N, K);

printf("Дано:\n\t%4.f\n\t%4.f\n\t_________\nОтвет:\n\t%+08.3f", n, L, n/L);
}